open-watt/urt/src/urt/driver/esp32/ow_shim.c
#define OW_GPIO_INTERRUPTS 2

typedef struct {
    unsigned input_gpio;
    bool open;
} ow_gpio_interrupt_t;

static ow_gpio_interrupt_t gpio_interrupts[OW_GPIO_INTERRUPTS];
static volatile uintptr_t gpio_interrupt_callbacks[OW_GPIO_INTERRUPTS];
static unsigned gpio_isr_users;
static bool gpio_isr_service_owned;

static int gpio_isr_acquire(void)
{
    if (gpio_isr_users) {
        ++gpio_isr_users;
        return 0;
    }
    if (gpio_install_isr_service(ESP_INTR_FLAG_IRAM) != ESP_OK)
        return -1;
    gpio_isr_service_owned = true;
    gpio_isr_users = 1;
    return 0;
}

static void gpio_isr_release(void)
{
    if (!gpio_isr_users || --gpio_isr_users)
        return;
    if (gpio_isr_service_owned) {
        gpio_uninstall_isr_service();
        gpio_isr_service_owned = false;
    }
}

static void IRAM_ATTR gpio_interrupt_handler(void *context)
{
    unsigned port = (unsigned)(uintptr_t)context;
    bool (*callback)(unsigned) = (bool (*)(unsigned))gpio_interrupt_callbacks[port];
    if (callback && callback(port))
        portYIELD_FROM_ISR();
}

void ow_gpio_interrupt_close(unsigned port);

int ow_gpio_interrupt_open(unsigned port, unsigned input_gpio, unsigned trigger)
{
    if (port >= OW_GPIO_INTERRUPTS || input_gpio >= SOC_GPIO_PIN_COUNT || trigger > 4)
        return -1;

    ow_gpio_interrupt_t *interrupt = &gpio_interrupts[port];
    if (interrupt->open || gpio_isr_acquire() != 0)
        return -1;
    static const gpio_int_type_t types[] = {
        GPIO_INTR_POSEDGE,
        GPIO_INTR_NEGEDGE,
        GPIO_INTR_ANYEDGE,
        GPIO_INTR_HIGH_LEVEL,
        GPIO_INTR_LOW_LEVEL,
    };
    interrupt->input_gpio = input_gpio;
    // Input buffer explicitly: the pin may be muxed to a peripheral output (only the output path is
    // routed), and edge detection needs GPIO_IN regardless of who drives the pad.
    if (gpio_input_enable((gpio_num_t)input_gpio) != ESP_OK ||
        gpio_set_intr_type((gpio_num_t)input_gpio, types[trigger]) != ESP_OK ||
        gpio_isr_handler_add((gpio_num_t)input_gpio, gpio_interrupt_handler, (void *)(uintptr_t)port) != ESP_OK) {
        gpio_isr_release();
        return -1;
    }
    interrupt->open = true;
    return 0;
}

void ow_gpio_interrupt_set_callback(unsigned port, bool (*callback)(unsigned port))
{
    if (port >= OW_GPIO_INTERRUPTS)
        return;
    gpio_interrupt_callbacks[port] = (uintptr_t)callback;
}

void ow_gpio_interrupt_close(unsigned port)
{
    if (port >= OW_GPIO_INTERRUPTS)
        return;
    ow_gpio_interrupt_t *interrupt = &gpio_interrupts[port];
    if (!interrupt->open)
        return;
    gpio_isr_handler_remove((gpio_num_t)interrupt->input_gpio);
    ow_gpio_interrupt_set_callback(port, NULL);
    interrupt->open = false;
    gpio_isr_release();
}

// -- Link fabric gpio events (dispatcher lives in D: ow_link_fire) --

extern bool ow_link_fire(unsigned slot);

static void IRAM_ATTR link_gpio_handler(void *context)
{
    if (ow_link_fire((unsigned)(uintptr_t)context))
        portYIELD_FROM_ISR();
}

int ow_link_gpio_open(unsigned slot, unsigned gpio, unsigned trigger)
{
    static const gpio_int_type_t types[] = {
        GPIO_INTR_POSEDGE,
        GPIO_INTR_NEGEDGE,
        GPIO_INTR_ANYEDGE,
    };
    if (gpio >= SOC_GPIO_PIN_COUNT || trigger > 2)
        return -1;
    if (gpio_isr_acquire() != 0)
        return -1;
    // Input buffer explicitly: the pin may be muxed to a peripheral output (only the output path is
    // routed), and edge detection needs GPIO_IN regardless of who drives the pad.
    if (gpio_input_enable((gpio_num_t)gpio) != ESP_OK ||
        gpio_set_intr_type((gpio_num_t)gpio, types[trigger]) != ESP_OK ||
        gpio_isr_handler_add((gpio_num_t)gpio, link_gpio_handler, (void *)(uintptr_t)slot) != ESP_OK) {
        gpio_isr_release();
        return -1;
    }
    return 0;
}

void ow_link_gpio_close(unsigned slot, unsigned gpio)
{
    (void)slot;
    if (gpio >= SOC_GPIO_PIN_COUNT)
        return;
    gpio_isr_handler_remove((gpio_num_t)gpio);
    gpio_isr_release();
}

#if defined(CONFIG_IDF_TARGET_ESP32)

// -- Reflex NMI routing (the handler itself is synthesized in D: xt_nmi) --

static intr_handle_t reflex_nmi_handle;
static unsigned reflex_users;

int ow_reflex_open(unsigned gpio, unsigned trigger)
{
    static const gpio_int_type_t types[] = {
        GPIO_INTR_POSEDGE,
        GPIO_INTR_NEGEDGE,
        GPIO_INTR_ANYEDGE,
    };
    if (gpio >= 32 || trigger > 2)
        return -1;
    if (!reflex_users) {
        // Route the GPIO NMI matrix source to CPU interrupt 14 (level 7). High-level
        // allocation requires a NULL handler; the vector dispatches to xt_nmi directly.
        if (esp_intr_alloc(ETS_GPIO_NMI_SOURCE, ESP_INTR_FLAG_NMI, NULL, NULL, &reflex_nmi_handle) != ESP_OK)
            return -1;
    }
    if (gpio_input_enable((gpio_num_t)gpio) != ESP_OK ||
        gpio_set_intr_type((gpio_num_t)gpio, types[trigger]) != ESP_OK) {
        if (!reflex_users) {
            esp_intr_free(reflex_nmi_handle);
            reflex_nmi_handle = NULL;
        }
        return -1;
    }
    ++reflex_users;
    // Per-pin register and the pin is claimed exclusively, so the RMW races nothing.
    GPIO.pin[gpio].int_ena |= BIT(3);   /* PRO CPU NMI */
    return 0;
}

void ow_reflex_close(unsigned gpio)
{
    if (gpio >= 32 || !reflex_users)
        return;
    GPIO.pin[gpio].int_ena &= ~BIT(3);
    gpio_set_intr_type((gpio_num_t)gpio, GPIO_INTR_DISABLE);
    if (--reflex_users == 0 && reflex_nmi_handle) {
        esp_intr_free(reflex_nmi_handle);
        reflex_nmi_handle = NULL;
    }
}

#else

int ow_reflex_open(unsigned gpio, unsigned trigger)
{
    (void)gpio;
    (void)trigger;
    return -1;
}

void ow_reflex_close(unsigned gpio)
{
    (void)gpio;
}

#endif

// -- ADC --

#if defined(CONFIG_IDF_TARGET_ESP32)
#include "soc/rtc_io_struct.h"
#include "soc/sens_reg.h"
#include "soc/sens_struct.h"

static portMUX_TYPE adc_locks[2] = {
    portMUX_INITIALIZER_UNLOCKED,
    portMUX_INITIALIZER_UNLOCKED,
};
#endif

static adc_atten_t adc_attenuation(unsigned attenuation)
{
    switch (attenuation) {
    case 0: return ADC_ATTEN_DB_0;
    case 1: return ADC_ATTEN_DB_2_5;
    case 2: return ADC_ATTEN_DB_6;
    default: return ADC_ATTEN_DB_12;
    }
}

int ow_adc_open(unsigned unit, void **handle)
{
    if (!handle || unit >= SOC_ADC_PERIPH_NUM)
        return -1;

    adc_oneshot_unit_init_cfg_t config = {
        .unit_id = (adc_unit_t)unit,
    };
    if (adc_oneshot_new_unit(&config, (adc_oneshot_unit_handle_t *)handle) != ESP_OK)
        return -1;
    return 0;
}

int ow_adc_input_open(void *handle, unsigned unit, unsigned channel, unsigned attenuation, unsigned bit_width, unsigned default_reference_mv, void **calibration, int *calibration_source)
{
    if (!handle || !calibration || !calibration_source || unit >= SOC_ADC_PERIPH_NUM || bit_width == 0)
        return -1;

    adc_atten_t atten = adc_attenuation(attenuation);
    adc_oneshot_chan_cfg_t input_config = {
        .atten = atten,
        .bitwidth = (adc_bitwidth_t)bit_width,
    };
    if (adc_oneshot_config_channel((adc_oneshot_unit_handle_t)handle, (adc_channel_t)channel, &input_config) != ESP_OK)
        return -1;
    *calibration = NULL;
    *calibration_source = -1;
#if ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    adc_cali_line_fitting_config_t calibration_config = {
        .unit_id = (adc_unit_t)unit,
        .atten = atten,
        .bitwidth = (adc_bitwidth_t)bit_width,
#if CONFIG_IDF_TARGET_ESP32
        .default_vref = default_reference_mv,
#endif
    };
    if (adc_cali_create_scheme_line_fitting(&calibration_config, (adc_cali_handle_t *)calibration) != ESP_OK)
        return -1;
#if CONFIG_IDF_TARGET_ESP32
    adc_cali_line_fitting_efuse_val_t source;
    *calibration_source = adc_cali_scheme_line_fitting_check_efuse(&source) == ESP_OK ? (int)source : -1;
#else
    (void)default_reference_mv;
    *calibration_source = 0;
#endif
#elif ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    // curve fitting only exists with factory efuse data; without it the input still reads raw
    (void)default_reference_mv;
    adc_cali_curve_fitting_config_t calibration_config = {
        .unit_id = (adc_unit_t)unit,
        .chan = (adc_channel_t)channel,
        .atten = atten,
        .bitwidth = (adc_bitwidth_t)bit_width,
    };
    if (adc_cali_create_scheme_curve_fitting(&calibration_config, (adc_cali_handle_t *)calibration) == ESP_OK)
        *calibration_source = 0;
#else
    (void)default_reference_mv;
#endif
    return 0;
}

