open-watt/urt/src/urt/driver/esp32/ow_shim.c
#if defined(CONFIG_IDF_TARGET_ESP32)
static uint16_t adc1_read_isr(unsigned channel);
#endif

int ow_adc_read(void *handle, unsigned unit, unsigned channel, unsigned *raw)
{
    int value;
    if (!handle || !raw || unit >= SOC_ADC_PERIPH_NUM)
        return -1;
#if defined(CONFIG_IDF_TARGET_ESP32)
    if (unit == ADC_UNIT_1) {
        portENTER_CRITICAL(&adc_locks[unit]);
        value = adc1_read_isr(channel);
        portEXIT_CRITICAL(&adc_locks[unit]);
    } else
#endif
    if (adc_oneshot_read((adc_oneshot_unit_handle_t)handle, (adc_channel_t)channel, &value) != ESP_OK)
        return -1;
    *raw = (unsigned)value;
    return 0;
}

int IRAM_ATTR ow_adc_read_critical(unsigned channel, unsigned *raw)
{
#if defined(CONFIG_IDF_TARGET_ESP32)
    portENTER_CRITICAL_SAFE(&adc_locks[0]);
    uint16_t value = adc1_read_isr(channel);
    portEXIT_CRITICAL_SAFE(&adc_locks[0]);
    *raw = value;
    return 0;
#else
    (void)channel;
    (void)raw;
    return -1;
#endif
}

int ow_adc_raw_to_mv(void *calibration, unsigned raw, unsigned *millivolts)
{
    int value;
    if (!calibration || !millivolts || adc_cali_raw_to_voltage((adc_cali_handle_t)calibration, raw, &value) != ESP_OK)
        return -1;
    *millivolts = (unsigned)value;
    return 0;
}

void ow_adc_input_close(void *calibration)
{
    if (!calibration)
        return;
#if ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    adc_cali_delete_scheme_line_fitting((adc_cali_handle_t)calibration);
#elif ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    adc_cali_delete_scheme_curve_fitting((adc_cali_handle_t)calibration);
#endif
}

void ow_adc_close(void *handle)
{
    if (handle)
        adc_oneshot_del_unit((adc_oneshot_unit_handle_t)handle);
}

#if defined(CONFIG_IDF_TARGET_ESP32)
static uint16_t IRAM_ATTR adc1_read_isr(unsigned channel)
{
    SENS.sar_read_ctrl.sar1_dig_force = 0;
    SENS.sar_meas_wait2.force_xpd_sar = SENS_FORCE_XPD_SAR_PU;
    RTCIO.hall_sens.xpd_hall = false;
    SENS.sar_meas_wait2.force_xpd_amp = SENS_FORCE_XPD_AMP_PD;
    SENS.sar_meas_ctrl.amp_rst_fb_fsm = 0;
    SENS.sar_meas_ctrl.amp_short_ref_fsm = 0;
    SENS.sar_meas_ctrl.amp_short_ref_gnd_fsm = 0;
    SENS.sar_meas_wait1.sar_amp_wait1 = 1;
    SENS.sar_meas_wait1.sar_amp_wait2 = 1;
    SENS.sar_meas_wait2.sar_amp_wait3 = 1;
    SENS.sar_meas_start1.meas1_start_force = 1;
    SENS.sar_meas_start1.sar1_en_pad_force = 1;
    SENS.sar_touch_ctrl1.xpd_hall_force = 1;
    SENS.sar_touch_ctrl1.hall_phase_force = 1;
    SENS.sar_meas_start1.sar1_en_pad = 1U << channel;
    while (SENS.sar_slave_addr1.meas_status != 0) {}
    SENS.sar_meas_start1.meas1_start_sar = 0;
    SENS.sar_meas_start1.meas1_start_sar = 1;
    while (SENS.sar_meas_start1.meas1_done_sar == 0) {}
    return SENS.sar_meas_start1.meas1_data_sar;
}

#endif

// -- I2C master wrappers --

#include "driver/i2c_master.h"

#ifdef SOC_HP_I2C_NUM
#define OW_I2C_COUNT SOC_HP_I2C_NUM
#else
#define OW_I2C_COUNT SOC_I2C_NUM
#endif
#define I2C_REQUEST_QUEUE_SIZE 1
#define I2C_WORKER_STACK 3072

typedef bool (*ow_i2c_callback_t)(void *context, int result);

typedef struct {
    uint16_t address;
    uint32_t frequency;
    uint8_t address_mode;
    const void *write_data;
    size_t write_length;
    void *read_data;
    size_t read_length;
    int timeout_ms;
    ow_i2c_callback_t callback;
    void *callback_context;
} ow_i2c_request_t;

typedef struct {
    i2c_master_bus_handle_t bus;
    i2c_master_dev_handle_t device;
    uint16_t address;
    uint32_t frequency;
    uint8_t address_mode;
    QueueHandle_t queue;
    TaskHandle_t worker;
    SemaphoreHandle_t worker_done;
    StaticSemaphore_t worker_done_storage;
    atomic_bool initialized;
} ow_i2c_context_t;

static ow_i2c_context_t i2c_contexts[OW_I2C_COUNT];

static bool ow_i2c_configure_device(ow_i2c_context_t *context, uint16_t address, uint8_t address_mode, uint32_t frequency)
{
    if (context->device && context->address == address && context->address_mode == address_mode && context->frequency == frequency)
        return true;

    if (context->device) {
        if (i2c_master_bus_rm_device(context->device) != ESP_OK)
            return false;
        context->device = NULL;
    }

    i2c_device_config_t device_config = {
        .dev_addr_length = address_mode ? I2C_ADDR_BIT_LEN_10 : I2C_ADDR_BIT_LEN_7,
        .device_address = address,
        .scl_speed_hz = frequency,
    };
    if (i2c_master_bus_add_device(context->bus, &device_config, &context->device) != ESP_OK)
        return false;

    context->address = address;
    context->address_mode = address_mode;
    context->frequency = frequency;
    return true;
}

static int ow_i2c_result(esp_err_t result)
{
    if (result == ESP_OK)
        return 0;
    // ESP-IDF 6.0 i2c_master_transmit(), i2c_master_receive(), and i2c_master_transmit_receive() return this result when a transaction receives NACK.
    if (result == ESP_ERR_INVALID_RESPONSE)
        return 1;
    if (result == ESP_ERR_TIMEOUT)
        return 2;
    return 4;
}

static void ow_i2c_worker(void *argument)
{
    ow_i2c_context_t *context = argument;
    ow_i2c_request_t request;

    while (xQueueReceive(context->queue, &request, portMAX_DELAY) == pdTRUE) {
        if (!request.callback)
            break;

        esp_err_t result = ESP_FAIL;
        if (ow_i2c_configure_device(context, request.address, request.address_mode, request.frequency)) {
            if (request.write_length && request.read_length)
                result = i2c_master_transmit_receive(context->device, request.write_data, request.write_length, request.read_data, request.read_length, request.timeout_ms);
            else if (request.write_length)
                result = i2c_master_transmit(context->device, request.write_data, request.write_length, request.timeout_ms);
            else
                result = i2c_master_receive(context->device, request.read_data, request.read_length, request.timeout_ms);
        }
        request.callback(request.callback_context, ow_i2c_result(result));
    }

    xSemaphoreGive(context->worker_done);
    vTaskDelete(NULL);
}

