open-watt/urt/src/urt/driver/esp32/ow_shim.c
uint32_t ow_i2c_count(void)
{
    return OW_I2C_COUNT;
}

void *ow_i2c_open(unsigned port, int sda_gpio, int scl_gpio, bool internal_pullups)
{
    if (port >= OW_I2C_COUNT)
        return NULL;

    ow_i2c_context_t *context = &i2c_contexts[port];
    if (atomic_exchange_explicit(&context->initialized, true, memory_order_acq_rel))
        return NULL;

    i2c_master_bus_config_t bus_config = {
        .i2c_port = port,
        .sda_io_num = sda_gpio,
        .scl_io_num = scl_gpio,
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .glitch_ignore_cnt = 7,
        .flags.enable_internal_pullup = internal_pullups,
    };
    if (i2c_new_master_bus(&bus_config, &context->bus) != ESP_OK)
        goto fail;

    context->queue = xQueueCreate(I2C_REQUEST_QUEUE_SIZE, sizeof(ow_i2c_request_t));
    if (!context->queue)
        goto fail;

    if (!context->worker_done)
        context->worker_done = xSemaphoreCreateBinaryStatic(&context->worker_done_storage);
    if (!context->worker_done)
        goto fail;
    xSemaphoreTake(context->worker_done, 0);

    if (xTaskCreate(ow_i2c_worker, "ow-i2c", I2C_WORKER_STACK, context, tskIDLE_PRIORITY + 2, &context->worker) != pdPASS)
        goto fail;
    return context;

fail:
    if (context->queue) {
        vQueueDelete(context->queue);
        context->queue = NULL;
    }
    if (context->bus) {
        i2c_del_master_bus(context->bus);
        context->bus = NULL;
    }
    atomic_store_explicit(&context->initialized, false, memory_order_release);
    return NULL;
}

void ow_i2c_close(void *context_ptr)
{
    ow_i2c_context_t *context = context_ptr;
    if (!context || !atomic_exchange_explicit(&context->initialized, false, memory_order_acq_rel))
        return;

    configASSERT(xTaskGetCurrentTaskHandle() != context->worker);
    ow_i2c_request_t request = {0};
    xQueueSend(context->queue, &request, portMAX_DELAY);
    xSemaphoreTake(context->worker_done, portMAX_DELAY);
    context->worker = NULL;

    if (context->device) {
        i2c_master_bus_rm_device(context->device);
        context->device = NULL;
    }
    if (context->bus) {
        i2c_del_master_bus(context->bus);
        context->bus = NULL;
    }
    vQueueDelete(context->queue);
    context->queue = NULL;
}

int ow_i2c_submit(void *context_ptr, uint16_t address, uint8_t address_mode, uint32_t frequency, const void *write_data, size_t write_length, void *read_data, size_t read_length, int timeout_ms, ow_i2c_callback_t callback, void *callback_context)
{
    ow_i2c_context_t *context = context_ptr;
    if (!context || !atomic_load_explicit(&context->initialized, memory_order_acquire) || !callback || (write_length == 0 && read_length == 0))
        return -1;

    ow_i2c_request_t request = {
        .address = address,
        .frequency = frequency,
        .address_mode = address_mode,
        .write_data = write_data,
        .write_length = write_length,
        .read_data = read_data,
        .read_length = read_length,
        .timeout_ms = timeout_ms,
        .callback = callback,
        .callback_context = callback_context,
    };
    return xQueueSend(context->queue, &request, 0) == pdTRUE ? 0 : -1;
}


// -- SPI master wrappers --

#include "driver/spi_master.h"
#include "esp_rom_gpio.h"
#include "soc/gpio_sig_map.h"
#include "soc/spi_periph.h"

// SPI1 is the flash controller; only the general-purpose hosts are exposed.
#define OW_SPI_COUNT (SOC_SPI_PERIPH_NUM - 1)

typedef bool (*ow_spi_callback_t)(void *context, int result);

typedef struct {
    spi_device_handle_t device;
    spi_host_device_t host;
    int mosi_gpio;
    spi_transaction_t transaction;
    ow_spi_callback_t callback;
    void *callback_context;
    void *read_data;
    size_t read_length;
    atomic_bool initialized;
} ow_spi_context_t;

static ow_spi_context_t spi_contexts[OW_SPI_COUNT];

// Runs in the SPI completion interrupt: SPI_DEVICE_NO_RETURN_RESULT means the descriptor is never posted back to a task.
static void IRAM_ATTR ow_spi_post(spi_transaction_t *transaction)
{
    ow_spi_context_t *context = transaction->user;
    if (!context)
        return;                 // priming transfer at open: no caller to notify

    // Only the descriptor-resident small-transfer path needs a copy out; DMA wrote straight into the caller's buffer.
    uint8_t *destination = context->read_data;
    for (size_t i = 0; i < context->read_length; ++i)
        destination[i] = transaction->rx_data[i];

    if (context->callback(context->callback_context, 0))
        portYIELD_FROM_ISR();
}

uint32_t ow_spi_count(void)
{
    return OW_SPI_COUNT;
}

void *ow_spi_open(unsigned port, int sck_gpio, int mosi_gpio, int miso_gpio, int cs_gpio, uint32_t frequency, uint8_t mode)
{
    if (port >= OW_SPI_COUNT)
        return NULL;

    ow_spi_context_t *context = &spi_contexts[port];
    if (atomic_exchange_explicit(&context->initialized, true, memory_order_acq_rel))
        return NULL;

    context->host = SPI2_HOST + port;
    context->mosi_gpio = mosi_gpio;
    spi_bus_config_t bus_config = {
        .sclk_io_num = sck_gpio,
        .mosi_io_num = mosi_gpio,
        .miso_io_num = miso_gpio,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = 4096,
    };
    bool bus_initialized = false;
    if (spi_bus_initialize(context->host, &bus_config, SPI_DMA_CH_AUTO) != ESP_OK)
        goto fail;
    bus_initialized = true;

    spi_device_interface_config_t device_config = {
        .clock_speed_hz = (int)frequency,
        .mode = mode,
        .spics_io_num = cs_gpio,
        .queue_size = 1,
        .flags = SPI_DEVICE_NO_RETURN_RESULT,
        .post_cb = ow_spi_post,
    };
    if (spi_bus_add_device(context->host, &device_config, &context->device) != ESP_OK)
        goto fail;

    // SCLK only settles at the mode's idle level once a transaction has run. A device with no
    // chip-select has no frame delimiter, so it counts the first edge after open as data and
    // every subsequent byte lands shifted. Prime the line before any caller can transmit.
    spi_transaction_t priming = {
        .length = 8,
        .flags = SPI_TRANS_USE_TXDATA,
    };
    spi_device_polling_transmit(context->device, &priming);
    return context;

