open-watt/urt/src/urt/driver/esp32/ow_shim.c
fail:
    if (bus_initialized)
        spi_bus_free(context->host);
    atomic_store_explicit(&context->initialized, false, memory_order_release);
    return NULL;
}

void ow_spi_close(void *context_ptr)
{
    ow_spi_context_t *context = context_ptr;
    if (!context || !atomic_exchange_explicit(&context->initialized, false, memory_order_acq_rel))
        return;

    spi_bus_remove_device(context->device);
    context->device = NULL;
    spi_bus_free(context->host);
}

int ow_spi_submit(void *context_ptr, const void *write_data, size_t write_length, void *read_data, size_t read_length, ow_spi_callback_t callback, void *callback_context)
{
    ow_spi_context_t *context = context_ptr;
    if (!context || !atomic_load_explicit(&context->initialized, memory_order_acquire) || !callback || (write_length == 0 && read_length == 0))
        return -1;
    // spi_device_queue_trans takes a FreeRTOS queue with task-context semantics, so a completion callback cannot resubmit directly.
    if (xPortInIsrContext())
        return -1;

    size_t length = write_length > read_length ? write_length : read_length;
    spi_transaction_t *transaction = &context->transaction;
    memset(transaction, 0, sizeof(*transaction));
    transaction->length = length * 8;
    transaction->user = context;

    context->callback = callback;
    context->callback_context = callback_context;
    context->read_data = read_data;
    context->read_length = 0;

    if (length <= 4)
    {
        // Small transfers ride inside the descriptor, so command bytes may live in flash rather than DMA-capable RAM.
        if (write_length)
        {
            transaction->flags |= SPI_TRANS_USE_TXDATA;
            memcpy(transaction->tx_data, write_data, write_length);
        }
        if (read_length)
        {
            transaction->flags |= SPI_TRANS_USE_RXDATA;
            context->read_length = read_length;
        }
    }
    else
    {
        transaction->tx_buffer = write_length ? write_data : NULL;
        transaction->rx_buffer = read_length ? read_data : NULL;
        if (read_length)
            transaction->rxlength = read_length * 8;
    }

    return spi_device_queue_trans(context->device, transaction, 0) == ESP_OK ? 0 : -1;
}

int ow_spi_suspend(void *context_ptr)
{
    ow_spi_context_t *context = context_ptr;
    if (!context || !atomic_load_explicit(&context->initialized, memory_order_acquire) || context->mosi_gpio < 0)
        return -1;
    // Hand MOSI's output stage back to the GPIO output register; the caller may now re-init and sample the pin.
    esp_rom_gpio_connect_out_signal(context->mosi_gpio, SIG_GPIO_OUT_IDX, false, false);
    return 0;
}

int ow_spi_resume(void *context_ptr)
{
    ow_spi_context_t *context = context_ptr;
    if (!context || !atomic_load_explicit(&context->initialized, memory_order_acquire) || context->mosi_gpio < 0)
        return -1;
    gpio_set_direction((gpio_num_t)context->mosi_gpio, GPIO_MODE_OUTPUT);
    esp_rom_gpio_connect_out_signal(context->mosi_gpio, spi_periph_signal[context->host].spid_out, false, false);
    return 0;
}


// -- UART driver wrappers --

#define NUM_UARTS SOC_UART_NUM
#define UART_RX_BUFFER_SIZE 1024
#define UART_TX_BUFFER_SIZE 1024
#define UART_EVENT_QUEUE_SIZE 16
#define UART_EVENT_TASK_STACK 3072

typedef void (*ow_uart_rx_ready_cb_t)(unsigned port, size_t available);

static atomic_bool uart_initialized[NUM_UARTS];
static QueueHandle_t uart_event_queue[NUM_UARTS];
static TaskHandle_t uart_event_task[NUM_UARTS];
static SemaphoreHandle_t uart_event_task_done[NUM_UARTS];
static StaticSemaphore_t uart_event_task_done_storage[NUM_UARTS];
static atomic_uint uart_errors[NUM_UARTS];
static _Atomic(ow_uart_rx_ready_cb_t) uart_rx_ready[NUM_UARTS];

// D enums: StopBits { half=0, one=1, one_point_five=2, two=3 }
//          Parity   { none=0, even=1, odd=2, mark=3, space=4 }
static const uart_stop_bits_t stop_bits_map[] = {
    UART_STOP_BITS_1, UART_STOP_BITS_1, UART_STOP_BITS_1_5, UART_STOP_BITS_2
};
static const uart_parity_t parity_map[] = {
    UART_PARITY_DISABLE, UART_PARITY_EVEN, UART_PARITY_ODD,
    UART_PARITY_DISABLE, UART_PARITY_DISABLE
};

static void ow_uart_event_task(void *argument)
{
    unsigned port = (unsigned)(uintptr_t)argument;
    uart_event_t event;

    while (xQueueReceive(uart_event_queue[port], &event, portMAX_DELAY) == pdTRUE)
    {
        if (event.type == UART_EVENT_MAX)
            break;

        unsigned error = 0;
        switch (event.type)
        {
            case UART_DATA:
            {
                size_t available = event.size;
                uart_get_buffered_data_len((uart_port_t)port, &available);
                ow_uart_rx_ready_cb_t callback = atomic_load_explicit(
                    &uart_rx_ready[port], memory_order_acquire);
                if (callback)
                    callback(port, available);
                continue;
            }
            case UART_BREAK:
                error = 1u << 4;
                break;
            case UART_BUFFER_FULL:
            case UART_FIFO_OVF:
                error = 1u << 2;
                uart_flush_input((uart_port_t)port);
                break;
            case UART_FRAME_ERR:
                error = 1u << 0;
                break;
            case UART_PARITY_ERR:
                error = 1u << 1;
                break;
            default:
                continue;
        }

        atomic_fetch_or_explicit(&uart_errors[port], error, memory_order_relaxed);
        ow_uart_rx_ready_cb_t callback = atomic_load_explicit(&uart_rx_ready[port], memory_order_acquire);
        if (callback)
            callback(port, 0);
    }

    xSemaphoreGive(uart_event_task_done[port]);
    vTaskDelete(NULL);
}

int ow_uart_open(unsigned port, uint32_t baud_rate, uint8_t data_bits,
                 uint8_t stop_bits, uint8_t parity,
                 int8_t tx_gpio, int8_t rx_gpio,
                 bool rs485_enabled, int8_t de_gpio, bool de_active_high,
                 ow_uart_rx_ready_cb_t rx_ready)
{
    if (port >= NUM_UARTS || atomic_load_explicit(&uart_initialized[port], memory_order_acquire) || data_bits < 5 || data_bits > 8)
        return 0;

