open-watt/urt/src/urt/driver/esp32/ow_shim.c
    uart_config_t config = {0};
    config.baud_rate = (int)baud_rate;
    config.data_bits = (uart_word_length_t)(UART_DATA_5_BITS + data_bits - 5);
    config.parity = parity < sizeof(parity_map) / sizeof(parity_map[0]) ? parity_map[parity] : UART_PARITY_DISABLE;
    config.stop_bits = stop_bits < sizeof(stop_bits_map) / sizeof(stop_bits_map[0]) ? stop_bits_map[stop_bits] : UART_STOP_BITS_1;
    config.flow_ctrl = UART_HW_FLOWCTRL_DISABLE;
    config.source_clk = UART_SCLK_DEFAULT;

    uart_port_t uart = (uart_port_t)port;
    if (uart_param_config(uart, &config) != ESP_OK ||
        uart_set_pin(uart, tx_gpio, rx_gpio, de_gpio, UART_PIN_NO_CHANGE) != ESP_OK ||
        uart_driver_install(uart, UART_RX_BUFFER_SIZE, UART_TX_BUFFER_SIZE, UART_EVENT_QUEUE_SIZE, &uart_event_queue[port], 0) != ESP_OK)
    {
        uart_event_queue[port] = NULL;
        return 0;
    }

    uint32_t inverse = rs485_enabled && !de_active_high ? UART_SIGNAL_RTS_INV : 0;
    if (uart_set_line_inverse(uart, inverse) != ESP_OK)
    {
        uart_driver_delete(uart);
        uart_event_queue[port] = NULL;
        return 0;
    }
    if (rs485_enabled && uart_set_mode(uart, UART_MODE_RS485_HALF_DUPLEX) != ESP_OK)
    {
        uart_driver_delete(uart);
        uart_event_queue[port] = NULL;
        return 0;
    }

    if (!uart_event_task_done[port])
        uart_event_task_done[port] = xSemaphoreCreateBinaryStatic(&uart_event_task_done_storage[port]);
    if (!uart_event_task_done[port])
    {
        uart_driver_delete(uart);
        uart_event_queue[port] = NULL;
        return 0;
    }
    xSemaphoreTake(uart_event_task_done[port], 0);

    atomic_store_explicit(&uart_errors[port], 0, memory_order_relaxed);
    atomic_store_explicit(&uart_rx_ready[port], rx_ready, memory_order_release);
    atomic_store_explicit(&uart_initialized[port], true, memory_order_release);
    if (xTaskCreate(ow_uart_event_task, "ow-uart", UART_EVENT_TASK_STACK, (void *)(uintptr_t)port, tskIDLE_PRIORITY + 2, &uart_event_task[port]) != pdPASS)
    {
        atomic_store_explicit(&uart_initialized[port], false, memory_order_release);
        atomic_store_explicit(&uart_rx_ready[port], NULL, memory_order_release);
        uart_driver_delete(uart);
        uart_event_queue[port] = NULL;
        return 0;
    }
    return 1;
}

void ow_uart_close(unsigned port)
{
    if (port >= NUM_UARTS || !atomic_exchange_explicit(&uart_initialized[port], false, memory_order_acq_rel))
        return;
    atomic_store_explicit(&uart_rx_ready[port], NULL, memory_order_release);
    if (uart_event_task[port])
    {
        configASSERT(xTaskGetCurrentTaskHandle() != uart_event_task[port]);
        uart_event_t shutdown = { .type = UART_EVENT_MAX };
        xQueueSendToFront(uart_event_queue[port], &shutdown, portMAX_DELAY);
        xSemaphoreTake(uart_event_task_done[port], portMAX_DELAY);
        uart_event_task[port] = NULL;
    }
    uart_driver_delete((uart_port_t)port);
    uart_event_queue[port] = NULL;
}

int32_t ow_uart_read(unsigned port, uint8_t *buf, int32_t len)
{
    if (port >= NUM_UARTS || !atomic_load_explicit(&uart_initialized[port], memory_order_acquire) || !buf || len <= 0)
        return 0;
    return uart_read_bytes((uart_port_t)port, buf, (uint32_t)len, 0);
}

int32_t ow_uart_write(unsigned port, const uint8_t *buf, int32_t len)
{
    if (port >= NUM_UARTS || !atomic_load_explicit(&uart_initialized[port], memory_order_acquire) || !buf || len <= 0)
        return 0;
    size_t available = 0;
    if (uart_get_tx_buffer_free_size((uart_port_t)port, &available) != ESP_OK)
        return -1;
    if ((size_t)len > available)
        len = (int32_t)available;
    return len > 0 ? uart_write_bytes((uart_port_t)port, buf, (size_t)len) : 0;
}

void ow_uart_poll(unsigned port)
{
    (void)port;
}

int32_t ow_uart_rx_pending(unsigned port)
{
    if (port >= NUM_UARTS || !atomic_load_explicit(&uart_initialized[port], memory_order_acquire))
        return 0;
    size_t available = 0;
    return uart_get_buffered_data_len((uart_port_t)port, &available) == ESP_OK ? (int32_t)available : 0;
}

// IDF only exposes the ring; the byte in flight and the hardware FIFO tail are
// not counted, ow_uart_tx_idle covers those.
int32_t ow_uart_tx_pending(unsigned port)
{
    if (port >= NUM_UARTS || !atomic_load_explicit(&uart_initialized[port], memory_order_acquire))
        return 0;
    size_t available = 0;
    if (uart_get_tx_buffer_free_size((uart_port_t)port, &available) != ESP_OK)
        return 0;
    return (int32_t)(UART_TX_BUFFER_SIZE - available);
}

int ow_uart_tx_idle(unsigned port)
{
    if (port >= NUM_UARTS || !atomic_load_explicit(&uart_initialized[port], memory_order_acquire))
        return 1;
    return uart_wait_tx_done((uart_port_t)port, 0) == ESP_OK;
}

int32_t ow_uart_flush(unsigned port)
{
    if (port >= NUM_UARTS || !atomic_load_explicit(&uart_initialized[port], memory_order_acquire))
        return 0;
    return uart_wait_tx_done((uart_port_t)port, portMAX_DELAY) == ESP_OK ? 0 : -1;
}

int ow_uart_check_errors(unsigned port)
{
    if (port >= NUM_UARTS || !atomic_load_explicit(&uart_initialized[port], memory_order_acquire))
        return 0;
    return (int)atomic_exchange_explicit(&uart_errors[port], 0, memory_order_relaxed);
}

// -- WiFi wrappers --

#if CONFIG_ESP_WIFI_ENABLED
#include "esp_wifi.h"
#include "esp_private/wifi.h"
#include "esp_event.h"
#include "esp_mac.h"

static int ow_wifi_refcount;

#ifdef OW_USE_LWIP
#include "esp_netif.h"

static esp_netif_t *ow_wifi_netif_sta;
static esp_netif_t *ow_wifi_netif_ap;
#endif

typedef void (*ow_wifi_event_cb_t)(int event_id, void *data, int data_len);

static ow_wifi_event_cb_t ow_wifi_sta_cb;
static ow_wifi_event_cb_t ow_wifi_ap_cb;

static void ow_wifi_event_handler(void *arg, esp_event_base_t base, int32_t event_id, void *event_data)
{
    if (base == WIFI_EVENT)
    {
        int data_len = 0;
        if (event_id == WIFI_EVENT_STA_DISCONNECTED && event_data)
            data_len = ((wifi_event_sta_disconnected_t *)event_data)->reason;

        switch (event_id)
        {
        case WIFI_EVENT_STA_CONNECTED:
        case WIFI_EVENT_STA_DISCONNECTED:
        case WIFI_EVENT_STA_START:
        case WIFI_EVENT_STA_STOP:
            if (ow_wifi_sta_cb)
                ow_wifi_sta_cb(event_id, event_data, data_len);
            break;

        case WIFI_EVENT_AP_START:
        case WIFI_EVENT_AP_STOP:
        case WIFI_EVENT_AP_STACONNECTED:
        case WIFI_EVENT_AP_STADISCONNECTED:
            if (ow_wifi_ap_cb)
                ow_wifi_ap_cb(event_id, event_data, 0);
            break;
        }
    }
#ifdef OW_USE_LWIP
    else if (base == IP_EVENT)
    {
        if (event_id == IP_EVENT_STA_GOT_IP && ow_wifi_sta_cb)
            ow_wifi_sta_cb(event_id, event_data, 0);
    }
#endif
}

