open-watt/urt/src/urt/driver/esp32/ow_shim.c
int ow_wifi_set_channel(int primary, int secondary)
{
    return esp_wifi_set_channel((uint8_t)primary, (wifi_second_chan_t)secondary) == ESP_OK ? 1 : 0;
}

// Inject a raw 802.11 frame. ifx selects WIFI_IF_STA (0) or WIFI_IF_AP (1).
// en_sys_seq=true lets the MAC fill the sequence number; the caller can
// still set destination/source MACs and frame control. Used by monitor-mode
// injection paths.
int ow_wifi_raw_tx(int ifx, const uint8_t *frame, int len, int en_sys_seq)
{
    return esp_wifi_80211_tx((wifi_interface_t)ifx, frame, len, en_sys_seq ? true : false) == ESP_OK ? 1 : 0;
}
#else // !CONFIG_ESP_WIFI_ENABLED

typedef void (*ow_wifi_event_cb_t)(int, void *, int);
typedef void (*ow_wifi_rx_cb_t)(const uint8_t *, int, int);
typedef void (*ow_wifi_promisc_cb_t)(int, int, int, int, int, int, const uint8_t *);

int ow_wifi_init(void) { return -1; }
void ow_wifi_deinit(void) {}
int ow_wifi_sta_config(const char *s, const char *p, const uint8_t *b) { (void)s;(void)p;(void)b; return 0; }
int ow_wifi_ap_config(const char *s, const char *p, uint8_t c, uint8_t m, uint8_t h) { (void)s;(void)p;(void)c;(void)m;(void)h; return 0; }
int ow_wifi_ap_set_max_clients(uint8_t m) { (void)m; return 0; }
int ow_wifi_sta_get_ap_info(uint8_t *b, int *r) { (void)b; (void)r; return 0; }
int ow_wifi_set_rx_callback(ow_wifi_rx_cb_t cb) { (void)cb; return 0; }
void ow_wifi_set_sta_callback(ow_wifi_event_cb_t cb) { (void)cb; }
void ow_wifi_set_ap_callback(ow_wifi_event_cb_t cb) { (void)cb; }
int ow_wifi_set_promiscuous(int enable, uint32_t filter_mask) { (void)enable;(void)filter_mask; return 0; }
void ow_wifi_set_promiscuous_callback(ow_wifi_promisc_cb_t cb) { (void)cb; }
int ow_wifi_set_channel(int p, int s) { (void)p;(void)s; return 0; }
int ow_wifi_raw_tx(int ifx, const uint8_t *frame, int len, int en) { (void)ifx;(void)frame;(void)len;(void)en; return 0; }

#endif // CONFIG_ESP_WIFI_ENABLED

// -- IEEE 802.15.4 radio wrappers --

typedef void (*ow_wpan_rx_cb_t)(const uint8_t *frame, int8_t rssi, uint8_t lqi, uint8_t channel, int pending);
typedef void (*ow_wpan_tx_cb_t)(int error, const uint8_t *ack, int8_t rssi, uint8_t lqi, uint8_t channel);

#if CONFIG_IEEE802154_ENABLED
#include "esp_ieee802154.h"

static ow_wpan_rx_cb_t ow_wpan_rx_cb;
static ow_wpan_tx_cb_t ow_wpan_tx_cb;

// Release the driver buffer after D has copied it.
static void IRAM_ATTR ow_wpan_rx_done(uint8_t *frame, esp_ieee802154_frame_info_t *info)
{
    if (ow_wpan_rx_cb)
        ow_wpan_rx_cb(frame, info->rssi, info->lqi, info->channel, info->pending ? 1 : 0);
    esp_ieee802154_receive_handle_done(frame);
}

static void IRAM_ATTR ow_wpan_tx_done(const uint8_t *frame, const uint8_t *ack, esp_ieee802154_frame_info_t *info)
{
    (void)frame;
    if (ow_wpan_tx_cb)
        ow_wpan_tx_cb(ESP_IEEE802154_TX_ERR_NONE, ack, ack ? info->rssi : 0, ack ? info->lqi : 0, ack ? info->channel : 0);
    if (ack)
        esp_ieee802154_receive_handle_done(ack);
}

static void IRAM_ATTR ow_wpan_tx_failed(const uint8_t *frame, esp_ieee802154_tx_error_t error)
{
    (void)frame;
    if (ow_wpan_tx_cb)
        ow_wpan_tx_cb((int)error, NULL, 0, 0, 0);
}

int ow_wpan_enable(ow_wpan_rx_cb_t rx, ow_wpan_tx_cb_t tx)
{
    ow_wpan_rx_cb = rx;
    ow_wpan_tx_cb = tx;
    esp_ieee802154_event_cb_list_t cbs = {
        .rx_done_cb = ow_wpan_rx_done,
        .tx_done_cb = ow_wpan_tx_done,
        .tx_failed_cb = ow_wpan_tx_failed,
    };
    if (esp_ieee802154_event_callback_list_register(cbs) != ESP_OK)
        return -1;
    if (esp_ieee802154_enable() != ESP_OK) {
        esp_ieee802154_event_callback_list_unregister();
        return -1;
    }
    return 0;
}

void ow_wpan_disable(void)
{
    esp_ieee802154_disable();
    esp_ieee802154_event_callback_list_unregister();
    ow_wpan_rx_cb = NULL;
    ow_wpan_tx_cb = NULL;
}
#else // !CONFIG_IEEE802154_ENABLED
int ow_wpan_enable(ow_wpan_rx_cb_t rx, ow_wpan_tx_cb_t tx) { (void)rx; (void)tx; return -1; }
void ow_wpan_disable(void) {}
#endif // CONFIG_IEEE802154_ENABLED

// -- Ethernet (EMAC) wrappers --
//
// eth_esp32_emac_config_t has target-conditional members and a per-target default
// initialiser, so the struct is assembled here and D passes ow_eth_config_t.

#ifdef OW_USE_ETHERNET
#include "esp_eth.h"
#include "esp_event.h"
#include "hal/emac_hal.h"
#include "hal/emac_ll.h"

enum { OW_ETH_IF_DEFAULT, OW_ETH_IF_RMII, OW_ETH_IF_RGMII };
enum { OW_ETH_CLK_DEFAULT, OW_ETH_CLK_EXTERNAL, OW_ETH_CLK_OUTPUT };
enum { OW_ETH_PHY_GENERIC, OW_ETH_PHY_YT8531 };

typedef struct
{
    uint8_t phy;
    int8_t phy_addr;
    int8_t mdc_gpio;
    int8_t mdio_gpio;
    int8_t phy_reset_gpio;
    uint8_t phy_interface;
    uint8_t clock_mode;
    int8_t clock_gpio;
    int8_t clock_loopback_gpio;
    int8_t data_gpio[12];
    bool promiscuous;
    bool flow_control;
    bool timestamp;
    bool tx_checksum;
} ow_eth_config_t;

typedef void (*ow_eth_rx_cb_t)(uint8_t *buffer, uint32_t length, uint32_t seconds, uint32_t nanoseconds, int has_timestamp);
typedef void (*ow_eth_link_cb_t)(int up);

static esp_eth_handle_t ow_eth_handle;
static esp_eth_mac_t *ow_eth_mac;
static esp_eth_phy_t *ow_eth_phy;
static ow_eth_rx_cb_t ow_eth_rx_cb;
static ow_eth_link_cb_t ow_eth_link_cb;
static bool ow_eth_timestamps;
static bool ow_eth_inserting_checksum;

// The callee owns buffer and releases it through ow_eth_free.
static esp_err_t ow_eth_input(esp_eth_handle_t handle, uint8_t *buffer, uint32_t length, void *priv, void *info)
{
    eth_mac_time_t *ts = ow_eth_timestamps ? (eth_mac_time_t *)info : NULL;
    if (ow_eth_rx_cb)
        ow_eth_rx_cb(buffer, length, ts ? ts->seconds : 0, ts ? ts->nanoseconds : 0, ts != NULL);
    else
        free(buffer);
    return ESP_OK;
}

static void ow_eth_event(void *arg, esp_event_base_t base, int32_t id, void *data)
{
    if (!ow_eth_link_cb)
        return;
    if (id == ETHERNET_EVENT_CONNECTED)
        ow_eth_link_cb(1);
    else if (id == ETHERNET_EVENT_DISCONNECTED || id == ETHERNET_EVENT_STOP)
        ow_eth_link_cb(0);
}

static bool ow_eth_pins_given(const int8_t *pins, int count)
{
    for (int i = 0; i < count; ++i)
        if (pins[i] < 0)
            return false;
    return true;
}

static bool ow_eth_phy_ext_update(uint32_t ext_reg, uint32_t clear, uint32_t set)
{
    uint32_t value = ext_reg;
    esp_eth_phy_reg_rw_data_t reg = { .reg_addr = 0x1E, .reg_value_p = &value };
    if (esp_eth_ioctl(ow_eth_handle, ETH_CMD_WRITE_PHY_REG, &reg) != ESP_OK)
        return false;
    reg.reg_addr = 0x1F;
    if (esp_eth_ioctl(ow_eth_handle, ETH_CMD_READ_PHY_REG, &reg) != ESP_OK)
        return false;
    value = (value & ~clear) | set;
    return esp_eth_ioctl(ow_eth_handle, ETH_CMD_WRITE_PHY_REG, &reg) == ESP_OK;
}

