open-watt/urt/src/urt/driver/esp32/ow_shim.c
// The YT8531 comes out of hardware reset with autonegotiation off, which its datasheet does
// not say, and RGMII needs ~2ns on both clocks: rxc_dly_en, and 13 x 150ps on each tx_delay_sel.
static bool ow_eth_phy_yt8531_init(void)
{
    bool autonegotiate = true;
    return esp_eth_ioctl(ow_eth_handle, ETH_CMD_S_AUTONEGO, &autonegotiate) == ESP_OK &&
           ow_eth_phy_ext_update(0xA001, 0, 1u << 8) &&
           ow_eth_phy_ext_update(0xA003, 0xFF, (13u << 4) | 13u);
}

int ow_eth_close(void)
{
    if (ow_eth_handle)
    {
        esp_eth_stop(ow_eth_handle);
        esp_event_handler_unregister(ETH_EVENT, ESP_EVENT_ANY_ID, &ow_eth_event);
        if (esp_eth_driver_uninstall(ow_eth_handle) != ESP_OK)
            return -1;
        ow_eth_handle = NULL;
    }
    if (ow_eth_phy)
        ow_eth_phy->del(ow_eth_phy);
    if (ow_eth_mac)
        ow_eth_mac->del(ow_eth_mac);
    ow_eth_phy = NULL;
    ow_eth_mac = NULL;
    ow_eth_rx_cb = NULL;
    ow_eth_link_cb = NULL;
    return 0;
}

int ow_eth_open(const ow_eth_config_t *c, ow_eth_rx_cb_t rx, ow_eth_link_cb_t link)
{
    // A failed initialization may still own a driver.
    if (ow_eth_handle && ow_eth_close() != 0)
        return -1;

    eth_mac_config_t mac_config = ETH_MAC_DEFAULT_CONFIG();
    eth_esp32_emac_config_t emac = ETH_ESP32_EMAC_DEFAULT_CONFIG();
    eth_data_interface_t default_interface = emac.interface;

    if (c->mdc_gpio >= 0)
        emac.smi_gpio.mdc_num = c->mdc_gpio;
    if (c->mdio_gpio >= 0)
        emac.smi_gpio.mdio_num = c->mdio_gpio;

    if (c->phy_interface == OW_ETH_IF_RMII)
        emac.interface = EMAC_DATA_INTERFACE_RMII;
#if SOC_EMAC_SUPPORT_1000M
    else if (c->phy_interface == OW_ETH_IF_RGMII)
        emac.interface = EMAC_DATA_INTERFACE_RGMII;
#endif
    else if (c->phy_interface != OW_ETH_IF_DEFAULT)
        return -1;

    // The default initialiser only describes the default interface, so moving off it
    // leaves no pins to fall back on and every one must be given.
    bool moved = emac.interface != default_interface;

    if (emac.interface == EMAC_DATA_INTERFACE_RMII)
    {
        if (moved && (c->clock_mode == OW_ETH_CLK_DEFAULT || c->clock_gpio < 0))
            return -1;
        if (c->clock_mode == OW_ETH_CLK_EXTERNAL)
            emac.clock_config.rmii.clock_mode = EMAC_CLK_EXT_IN;
        else if (c->clock_mode == OW_ETH_CLK_OUTPUT)
            emac.clock_config.rmii.clock_mode = EMAC_CLK_OUT;
        if (c->clock_gpio >= 0)
            emac.clock_config.rmii.clock_gpio = c->clock_gpio;
#if !SOC_EMAC_RMII_CLK_OUT_INTERNAL_LOOPBACK
        // no internal loopback: an output clock comes back in on a second pad
        if (emac.clock_config.rmii.clock_mode == EMAC_CLK_OUT)
        {
            if (c->clock_loopback_gpio < 0)
                return -1;
            emac.clock_config_out_in.rmii.clock_mode = EMAC_CLK_EXT_IN;
            emac.clock_config_out_in.rmii.clock_gpio = c->clock_loopback_gpio;
        }
#endif
#if SOC_EMAC_USE_MULTI_IO_MUX
        if (moved && !ow_eth_pins_given(c->data_gpio, 6))
            return -1;
        eth_mac_rmii_gpio_config_t *p = &emac.emac_dataif_gpio.rmii;
        int *pins[6] = { &p->tx_en_num, &p->txd0_num, &p->txd1_num, &p->crs_dv_num, &p->rxd0_num, &p->rxd1_num };
        for (int i = 0; i < 6; ++i)
            if (c->data_gpio[i] >= 0)
                *pins[i] = c->data_gpio[i];
#endif
    }
#if SOC_EMAC_SUPPORT_1000M
    else if (emac.interface == EMAC_DATA_INTERFACE_RGMII)
    {
        if (moved && !ow_eth_pins_given(c->data_gpio, 12))
            return -1;
        eth_mac_rgmii_gpio_config_t *p = &emac.emac_dataif_gpio.rgmii;
        int *pins[12] = { &p->tx_ctl_num, &p->txd0_num, &p->txd1_num, &p->txd2_num, &p->txd3_num,
                          &p->rx_ctl_num, &p->rxd0_num, &p->rxd1_num, &p->rxd2_num, &p->rxd3_num,
                          &emac.clock_config.rgmii.clock_rx_gpio, &emac.clock_config.rgmii.clock_tx_gpio };
        for (int i = 0; i < 12; ++i)
            if (c->data_gpio[i] >= 0)
                *pins[i] = c->data_gpio[i];
    }
#endif

    eth_phy_config_t phy_config = ETH_PHY_DEFAULT_CONFIG();
    phy_config.phy_addr = c->phy_addr;
    phy_config.reset_gpio_num = c->phy_reset_gpio;
    // esp_eth_start otherwise blocks its caller polling for negotiation, 4s with no cable;
    // the link check finds the result whenever the link arrives.
    phy_config.autonego_timeout_ms = 0;

    ow_eth_mac = esp_eth_mac_new_esp32(&emac, &mac_config);
    ow_eth_phy = esp_eth_phy_new_generic(&phy_config);
    if (!ow_eth_mac || !ow_eth_phy)
    {
        ow_eth_close();
        return -1;
    }

    esp_eth_config_t config = ETH_DEFAULT_CONFIG(ow_eth_mac, ow_eth_phy);
    if (esp_eth_driver_install(&config, &ow_eth_handle) != ESP_OK)
    {
        ow_eth_handle = NULL;
        ow_eth_close();
        return -1;
    }

    ow_eth_rx_cb = rx;
    ow_eth_link_cb = link;
    ow_eth_timestamps = false;
    ow_eth_inserting_checksum = false;
    // The checksum engine only completes a frame it holds whole, and esp_eth runs the FIFO cut-through.
    if (c->tx_checksum)
        emac_ll_trans_store_forward_enable(&EMAC_DMA, true);

    bool promiscuous = c->promiscuous;
    bool flow_control = c->flow_control;
    bool ok = esp_eth_update_input_path_info(ow_eth_handle, &ow_eth_input, NULL) == ESP_OK &&
              esp_event_handler_register(ETH_EVENT, ESP_EVENT_ANY_ID, &ow_eth_event, NULL) == ESP_OK &&
              esp_eth_ioctl(ow_eth_handle, ETH_CMD_S_PROMISCUOUS, &promiscuous) == ESP_OK &&
              esp_eth_ioctl(ow_eth_handle, ETH_CMD_S_FLOW_CTRL, &flow_control) == ESP_OK;
    if (ok && c->phy == OW_ETH_PHY_YT8531)
        ok = ow_eth_phy_yt8531_init();
#ifdef SOC_EMAC_IEEE1588V2_SUPPORTED
    if (ok && c->timestamp)
    {
        eth_mac_ptp_config_t ptp = ETH_MAC_ESP_PTP_DEFAULT_CONFIG();
        ok = esp_eth_mac_ptp_enable(ow_eth_mac, &ptp) == ESP_OK;
        ow_eth_timestamps = ok;
    }
#endif
    if (!ok || esp_eth_start(ow_eth_handle) != ESP_OK)
    {
        ow_eth_close();
        return -1;
    }
    return 0;
}

