open-watt/urt/src/urt/driver/esp32/ow_shim.c
int ow_eth_tx(const uint8_t *frame, uint32_t length, bool insert_checksum)
{
    // esp_eth applies these descriptor bits to every frame until told otherwise, so flip them per frame:
    // left on, the MAC would also rewrite the checksums of frames this port only bridges.
    if (insert_checksum != ow_eth_inserting_checksum)
    {
        uint32_t bits = EMAC_HAL_TDES0_IP_CRC_INSERT_HDR_PAYLOAD_PSEUDO;
        esp_eth_ioctl(ow_eth_handle, insert_checksum ? ETH_MAC_ESP_CMD_SET_TDES0_CFG_BITS : ETH_MAC_ESP_CMD_CLEAR_TDES0_CFG_BITS, &bits);
        ow_eth_inserting_checksum = insert_checksum;
    }
    return esp_eth_transmit(ow_eth_handle, (void *)frame, length) == ESP_OK ? 0 : -1;
}

void ow_eth_free(void *buffer)
{
    free(buffer);
}

int ow_eth_set_mac(const uint8_t *mac)
{
    return esp_eth_ioctl(ow_eth_handle, ETH_CMD_S_MAC_ADDR, (void *)mac) == ESP_OK ? 0 : -1;
}

int ow_eth_set_promiscuous(bool enable)
{
    return esp_eth_ioctl(ow_eth_handle, ETH_CMD_S_PROMISCUOUS, &enable) == ESP_OK ? 0 : -1;
}

int ow_eth_get_link(int *speed, int *full_duplex)
{
    eth_speed_t s;
    eth_duplex_t d;
    if (esp_eth_ioctl(ow_eth_handle, ETH_CMD_G_SPEED, &s) != ESP_OK || esp_eth_ioctl(ow_eth_handle, ETH_CMD_G_DUPLEX_MODE, &d) != ESP_OK)
        return -1;
    *speed = s == ETH_SPEED_10M ? 0 : s == ETH_SPEED_100M ? 1 : 2;
    *full_duplex = d == ETH_DUPLEX_FULL;
    return 0;
}

// The driver refuses link-mode changes while started.
int ow_eth_set_link_mode(bool autonegotiate, int speed, bool full_duplex)
{
    eth_speed_t s = speed == 0 ? ETH_SPEED_10M : speed == 1 ? ETH_SPEED_100M :
#if SOC_EMAC_SUPPORT_1000M
                    ETH_SPEED_1000M;
#else
                    ETH_SPEED_100M;
#endif
    eth_duplex_t d = full_duplex ? ETH_DUPLEX_FULL : ETH_DUPLEX_HALF;

    if (esp_eth_stop(ow_eth_handle) != ESP_OK)
        return -1;
    bool ok = esp_eth_ioctl(ow_eth_handle, ETH_CMD_S_AUTONEGO, &autonegotiate) == ESP_OK;
    if (ok && !autonegotiate)
        ok = esp_eth_ioctl(ow_eth_handle, ETH_CMD_S_SPEED, &s) == ESP_OK && esp_eth_ioctl(ow_eth_handle, ETH_CMD_S_DUPLEX_MODE, &d) == ESP_OK;
    return esp_eth_start(ow_eth_handle) == ESP_OK && ok ? 0 : -1;
}

#ifdef SOC_EMAC_IEEE1588V2_SUPPORTED
int ow_eth_get_time(uint32_t *seconds, uint32_t *nanoseconds)
{
    eth_mac_time_t t;
    if (esp_eth_mac_get_ptp_time(ow_eth_mac, &t) != ESP_OK)
        return -1;
    *seconds = t.seconds;
    *nanoseconds = t.nanoseconds;
    return 0;
}

int ow_eth_set_time(uint32_t seconds, uint32_t nanoseconds)
{
    eth_mac_time_t t = { .seconds = seconds, .nanoseconds = nanoseconds };
    return esp_eth_mac_set_ptp_time(ow_eth_mac, &t) == ESP_OK ? 0 : -1;
}

int ow_eth_adjust_frequency(int32_t ppb)
{
    return esp_eth_mac_adj_ptp_freq_ppb(ow_eth_mac, ppb) == ESP_OK ? 0 : -1;
}
#endif

#endif // OW_USE_ETHERNET

// -- BLE (NimBLE) wrappers --

#if CONFIG_BT_ENABLED && CONFIG_BT_NIMBLE_ENABLED
#include "nimble/nimble_port.h"
#include "nimble/nimble_port_freertos.h"
#include "host/ble_hs.h"
#include "host/ble_gap.h"

static void ow_nimble_host_task(void *param)
{
    (void)param;
    nimble_port_run();
    nimble_port_freertos_deinit();
}

int ow_ble_init(void)
{
    int rc = nimble_port_init();
    if (rc != 0)
        return rc;
    nimble_port_freertos_init(ow_nimble_host_task);
    return 0;
}

int ow_ble_deinit(void)
{
    int rc = nimble_port_stop();
    if (rc != 0)
        return rc;
    nimble_port_deinit();
    return 0;
}

#else // !BT_NIMBLE

int ow_ble_init(void) { return -1; }
int ow_ble_deinit(void) { return 0; }

#endif // CONFIG_BT_NIMBLE_ENABLED

// -- CAN (TWAI) driver --

#if SOC_TWAI_SUPPORTED
#include "esp_twai.h"
#include "esp_twai_onchip.h"

#define OW_CAN_RX_CAP 32
#define OW_CAN_TX_CAP 16

_Static_assert((OW_CAN_RX_CAP & (OW_CAN_RX_CAP - 1)) == 0, "CAN RX capacity must be a power of two");
_Static_assert(OW_CAN_TX_CAP <= 32, "CAN TX capacity exceeds the ownership bitmap");

typedef bool (*ow_can_rx_cb_t)(unsigned port);

typedef struct {
    uint32_t id;
    uint8_t flags;
    uint8_t dlc;
    uint8_t data[8];
} ow_can_frame_t;

typedef struct {
    twai_frame_t frame;
    uint8_t data[8];
} ow_can_tx_slot_t;

typedef struct {
    twai_node_handle_t handle;
    unsigned port;
    ow_can_rx_cb_t rx_cb;
    _Atomic uint32_t rx_head;
    _Atomic uint32_t rx_tail;
    _Atomic uint32_t rx_drops;
    _Atomic uint32_t errors;
    _Atomic uint32_t tx_used;
    ow_can_frame_t rx[OW_CAN_RX_CAP];
    ow_can_tx_slot_t tx[OW_CAN_TX_CAP];
} ow_can_context_t;

static ow_can_context_t ow_can_contexts[SOC_TWAI_CONTROLLER_NUM];

static ow_can_context_t *ow_can_find(twai_node_handle_t handle)
{
    if (!handle)
        return NULL;
    for (unsigned i = 0; i < SOC_TWAI_CONTROLLER_NUM; ++i)
        if (ow_can_contexts[i].handle == handle)
            return &ow_can_contexts[i];
    return NULL;
}

static bool ow_can_rx_done(twai_node_handle_t handle, const twai_rx_done_event_data_t *edata, void *user_ctx)
{
    (void)edata;
    ow_can_context_t *ctx = (ow_can_context_t *)user_ctx;
    uint8_t data[64];
    twai_frame_t frame = {
        .buffer = data,
        .buffer_len = sizeof(data),
    };
    if (twai_node_receive_from_isr(handle, &frame) != ESP_OK)
        return false;

    uint16_t length = twaifd_dlc2len(frame.header.dlc);
    uint32_t head = atomic_load_explicit(&ctx->rx_head, memory_order_relaxed);
    uint32_t tail = atomic_load_explicit(&ctx->rx_tail, memory_order_acquire);
    if (length > sizeof(ctx->rx[0].data))
    {
        // The portable frame carries only classic-CAN payloads. Account unsupported FD frames as drops, not queue overruns.
        atomic_fetch_add_explicit(&ctx->rx_drops, 1, memory_order_relaxed);
        return false;
    }
    if (head - tail >= OW_CAN_RX_CAP)
    {
        atomic_fetch_add_explicit(&ctx->rx_drops, 1, memory_order_relaxed);
        atomic_fetch_or_explicit(&ctx->errors, 1u << 5, memory_order_relaxed);
        return false;
    }

    ow_can_frame_t *slot = &ctx->rx[head & (OW_CAN_RX_CAP - 1)];
    slot->id = frame.header.id;
    slot->flags = (frame.header.ide ? 1 : 0) | (frame.header.rtr ? 2 : 0) | (frame.header.fdf ? 4 : 0) | (frame.header.brs ? 8 : 0);
    slot->dlc = (uint8_t)length;
    if (frame.header.rtr)
        memset(slot->data, 0, sizeof(slot->data));
    else if (length > 0)
        memcpy(slot->data, data, length);
    atomic_store_explicit(&ctx->rx_head, head + 1, memory_order_release);
    return ctx->rx_cb ? ctx->rx_cb(ctx->port) : false;
}

static bool ow_can_tx_done(twai_node_handle_t handle, const twai_tx_done_event_data_t *edata, void *user_ctx)
{
    (void)handle;
    ow_can_context_t *ctx = (ow_can_context_t *)user_ctx;
    if (!edata->is_tx_success)
        atomic_fetch_or_explicit(&ctx->errors, 1u << 4, memory_order_relaxed);
    if (edata->done_tx_frame)
    {
        ow_can_tx_slot_t *slot = (ow_can_tx_slot_t *)edata->done_tx_frame;
        unsigned index = (unsigned)(slot - ctx->tx);
        if (index < OW_CAN_TX_CAP)
            atomic_fetch_and_explicit(&ctx->tx_used, ~(1u << index), memory_order_release);
    }
    return false;
}

static bool ow_can_error(twai_node_handle_t handle, const twai_error_event_data_t *edata, void *user_ctx)
{
    (void)handle;
    ow_can_context_t *ctx = (ow_can_context_t *)user_ctx;
    uint32_t errors = 0;
    // ESP-IDF 6.0 exposes arbitration, bit, form, stuff, and ACK flags here, but no CRC flag.
    if (edata->err_flags.bit_err)
        errors |= 1u << 0;
    if (edata->err_flags.stuff_err)
        errors |= 1u << 1;
    if (edata->err_flags.form_err)
        errors |= 1u << 3;
    if (edata->err_flags.ack_err)
        errors |= 1u << 4;
    atomic_fetch_or_explicit(&ctx->errors, errors, memory_order_relaxed);
    return false;
}

twai_node_handle_t ow_can_open(unsigned port, uint32_t bitrate, int tx_gpio, int rx_gpio, uint8_t sjw, uint8_t tseg1, uint8_t tseg2, uint16_t brp, ow_can_rx_cb_t rx_cb)
{
    if (port >= SOC_TWAI_CONTROLLER_NUM || bitrate == 0 || tx_gpio < 0 || rx_gpio < 0)
        return NULL;

    ow_can_context_t *ctx = &ow_can_contexts[port];
    if (ctx->handle)
        return ctx->handle;

    twai_onchip_node_config_t config = {
        .io_cfg = {
            .tx = tx_gpio,
            .rx = rx_gpio,
            .quanta_clk_out = -1,
            .bus_off_indicator = -1,
        },
        .bit_timing = {
            .bitrate = bitrate,
        },
        .fail_retry_cnt = -1,
        .tx_queue_depth = OW_CAN_TX_CAP,
    };

