open-watt/urt/src/urt/driver/esp32/ow_shim.c
    twai_node_handle_t handle = NULL;
    if (twai_new_node_onchip(&config, &handle) != ESP_OK)
        return NULL;

    if (brp > 0)
    {
        twai_timing_advanced_config_t timing = {
            .brp = brp,
            .tseg_1 = tseg1,
            .tseg_2 = tseg2,
            .sjw = sjw,
        };
        if (twai_node_reconfig_timing(handle, &timing, NULL) != ESP_OK)
        {
            twai_node_delete(handle);
            return NULL;
        }
    }

    memset(ctx, 0, sizeof(*ctx));
    ctx->handle = handle;
    ctx->port = port;
    ctx->rx_cb = rx_cb;

    const twai_event_callbacks_t callbacks = {
        .on_tx_done = &ow_can_tx_done,
        .on_rx_done = &ow_can_rx_done,
        .on_error = &ow_can_error,
    };
    if (twai_node_register_event_callbacks(handle, &callbacks, ctx) != ESP_OK || twai_node_enable(handle) != ESP_OK)
    {
        ctx->handle = NULL;
        twai_node_delete(handle);
        return NULL;
    }
    return handle;
}

void ow_can_close(twai_node_handle_t handle)
{
    ow_can_context_t *ctx = ow_can_find(handle);
    if (!ctx)
        return;
    twai_node_disable(handle);
    twai_node_delete(handle);
    memset(ctx, 0, sizeof(*ctx));
}

bool ow_can_transmit(twai_node_handle_t handle, uint32_t id, uint8_t flags, uint8_t dlc, const uint8_t *data)
{
    ow_can_context_t *ctx = ow_can_find(handle);
    if (!ctx || dlc > 8 || (!data && dlc > 0))
        return false;

    uint32_t used = atomic_load_explicit(&ctx->tx_used, memory_order_relaxed);
    unsigned index;
    for (;;)
    {
        for (index = 0; index < OW_CAN_TX_CAP; ++index)
            if (!(used & (1u << index)))
                break;
        if (index == OW_CAN_TX_CAP)
            return false;
        uint32_t desired = used | (1u << index);
        if (atomic_compare_exchange_weak_explicit(&ctx->tx_used, &used, desired, memory_order_acquire, memory_order_relaxed))
            break;
    }

    ow_can_tx_slot_t *slot = &ctx->tx[index];
    memset(slot, 0, sizeof(*slot));
    slot->frame.header.id = id;
    slot->frame.header.dlc = dlc;
    slot->frame.header.ide = (flags & 1) != 0;
    slot->frame.header.rtr = (flags & 2) != 0;
    slot->frame.header.fdf = (flags & 4) != 0;
    slot->frame.header.brs = (flags & 8) != 0;
    slot->frame.buffer = slot->data;
    slot->frame.buffer_len = dlc;
    if (!(flags & 2) && dlc > 0)
        memcpy(slot->data, data, dlc);

    if (twai_node_transmit(handle, &slot->frame, 0) != ESP_OK)
    {
        atomic_fetch_and_explicit(&ctx->tx_used, ~(1u << index), memory_order_release);
        return false;
    }
    return true;
}

bool ow_can_receive(twai_node_handle_t handle, ow_can_frame_t *frame)
{
    ow_can_context_t *ctx = ow_can_find(handle);
    if (!ctx || !frame)
        return false;
    uint32_t tail = atomic_load_explicit(&ctx->rx_tail, memory_order_relaxed);
    uint32_t head = atomic_load_explicit(&ctx->rx_head, memory_order_acquire);
    if (tail == head)
        return false;
    *frame = ctx->rx[tail & (OW_CAN_RX_CAP - 1)];
    atomic_store_explicit(&ctx->rx_tail, tail + 1, memory_order_release);
    return true;
}

uint32_t ow_can_check_errors(twai_node_handle_t handle)
{
    ow_can_context_t *ctx = ow_can_find(handle);
    return ctx ? atomic_exchange_explicit(&ctx->errors, 0, memory_order_relaxed) : 0;
}

uint32_t ow_can_take_rx_drops(twai_node_handle_t handle)
{
    ow_can_context_t *ctx = ow_can_find(handle);
    return ctx ? atomic_exchange_explicit(&ctx->rx_drops, 0, memory_order_relaxed) : 0;
}

uint32_t ow_can_bus_state(twai_node_handle_t handle)
{
    twai_node_status_t status;
    return twai_node_get_info(handle, &status, NULL) == ESP_OK ? (uint32_t)status.state : (uint32_t)TWAI_ERROR_BUS_OFF;
}

uint32_t ow_can_tx_error_count(twai_node_handle_t handle)
{
    twai_node_status_t status;
    return twai_node_get_info(handle, &status, NULL) == ESP_OK ? status.tx_error_count : 0;
}

uint32_t ow_can_rx_error_count(twai_node_handle_t handle)
{
    twai_node_status_t status;
    return twai_node_get_info(handle, &status, NULL) == ESP_OK ? status.rx_error_count : 0;
}

size_t ow_can_rx_available(twai_node_handle_t handle)
{
    ow_can_context_t *ctx = ow_can_find(handle);
    if (!ctx)
        return 0;
    uint32_t head = atomic_load_explicit(&ctx->rx_head, memory_order_acquire);
    uint32_t tail = atomic_load_explicit(&ctx->rx_tail, memory_order_relaxed);
    return head - tail;
}

void ow_can_rx_flush(twai_node_handle_t handle)
{
    ow_can_context_t *ctx = ow_can_find(handle);
    if (!ctx)
        return;
    uint32_t head = atomic_load_explicit(&ctx->rx_head, memory_order_acquire);
    atomic_store_explicit(&ctx->rx_tail, head, memory_order_release);
}

bool ow_can_bus_recover(twai_node_handle_t handle)
{
    return twai_node_recover(handle) == ESP_OK;
}

#else // !SOC_TWAI_SUPPORTED

typedef struct twai_node_base *twai_node_handle_t;
typedef bool (*ow_can_rx_cb_t)(unsigned);
typedef struct {
    uint32_t id;
    uint8_t flags;
    uint8_t dlc;
    uint8_t data[8];
} ow_can_frame_t;

twai_node_handle_t ow_can_open(unsigned port, uint32_t bitrate, int tx_gpio, int rx_gpio, uint8_t sjw, uint8_t tseg1, uint8_t tseg2, uint16_t brp, ow_can_rx_cb_t rx_cb)
{
    return NULL;
}
void ow_can_close(twai_node_handle_t handle) {}
bool ow_can_transmit(twai_node_handle_t handle, uint32_t id, uint8_t flags, uint8_t dlc, const uint8_t *data) { return false; }
bool ow_can_receive(twai_node_handle_t handle, ow_can_frame_t *frame) { return false; }
uint32_t ow_can_check_errors(twai_node_handle_t handle) { return 0; }
uint32_t ow_can_take_rx_drops(twai_node_handle_t handle) { return 0; }
uint32_t ow_can_bus_state(twai_node_handle_t handle) { return 3; } // CanBusState.bus_off
uint32_t ow_can_tx_error_count(twai_node_handle_t handle) { return 0; }
uint32_t ow_can_rx_error_count(twai_node_handle_t handle) { return 0; }
size_t ow_can_rx_available(twai_node_handle_t handle) { return 0; }
void ow_can_rx_flush(twai_node_handle_t handle) {}
bool ow_can_bus_recover(twai_node_handle_t handle) { return false; }

#endif // SOC_TWAI_SUPPORTED

#ifdef OW_USE_LWIP
// -- lwIP netdb wrappers (link-order fix) --
// D object references lwip_getaddrinfo/lwip_freeaddrinfo but the D object
// appears after liblwip.a in the link. These wrappers are in libmain.a
// which is linked with --whole-archive, ensuring they're always present.

