open-watt/urt/src/urt/driver/esp32/ow_shim.c
int ow_lwip_getaddrinfo(const char *nodename, const char *servname, const struct addrinfo *hints, struct addrinfo **res)
{
    return lwip_getaddrinfo(nodename, servname, hints, res);
}

void ow_lwip_freeaddrinfo(struct addrinfo *ai)
{
    lwip_freeaddrinfo(ai);
}
#endif


// =====================================================================
// SPIFFS -- urt.file backend
//
// TRAJECTORY, not the destination.
//
// This rides newlib's open/read/write, which reach SPIFFS through IDF's VFS.
// That is why platforms/esp32s3/sdkconfig.defaults has to enable
// CONFIG_VFS_SUPPORT_IO and _DIR: with them off, open() is a stub returning
// ENOSYS even though the filesystem mounted fine. Those were deliberately off
// to save space, and turning them on costs every ESP target the whole syscall
// layer for the sake of a stopgap filesystem.
//
// Where this should go: mount SPIFFS directly with SPIFFS_mount() and read /
// write / erase callbacks over esp_partition_*, then call SPIFFS_open() and
// friends. No VFS, no newlib, no "/spiffs" prefixing, and the sdkconfig change
// reverts. The blocker is that IDF keeps spiffs.h in PRIV_INCLUDE_DIRS and
// esp_vfs_spiffs_register() keeps its spiffs* handle private, so it means
// either widening the include path or vendoring the SPIFFS sources -- the
// latter being what a non-Espressif target would need anyway.
//
// littlefs wants exactly that shape too (bring your own block device), so the
// work is not thrown away when this is replaced.
// =====================================================================

#ifdef OW_USE_SPIFFS

#include <dirent.h>
#include <fcntl.h>
#include <sys/stat.h>
#include <unistd.h>
#include "esp_spiffs.h"

#define OW_SPIFFS_ROOT "/spiffs"

// Registration state is ours, not esp_spiffs_mounted()'s: that reports whether
// the partition is mounted internally, which a format also does, and mounting
// the partition does not put a VFS on OW_SPIFFS_ROOT. -1 latches a failed mount
// so an unformatted partition is not retried on every access.
static int ow_spiffs_last_errno = 0;
static bool ow_spiffs_registered = false;
static int ow_spiffs_mount_state = 0;

static bool ow_spiffs_ready(void)
{
    if (ow_spiffs_registered)
        return true;
    if (ow_spiffs_mount_state < 0)
        return false;

    esp_vfs_spiffs_conf_t conf = {
        .base_path = OW_SPIFFS_ROOT,
        .partition_label = NULL,
        .max_files = 4,
        .format_if_mount_failed = false,
    };
    if (esp_vfs_spiffs_register(&conf) != ESP_OK)
    {
        ow_spiffs_mount_state = -1;
        return false;
    }
    ow_spiffs_registered = true;
    return true;
}

// Anchor caller paths under the mount point.
static bool ow_spiffs_path(const char *path, size_t path_len, char *buffer, size_t buffer_size)
{
    const size_t root = sizeof(OW_SPIFFS_ROOT) - 1;
    size_t skip = (path_len && path[0] == '/') ? 1 : 0;
    if (root + 1 + (path_len - skip) + 1 > buffer_size)
        return false;
    memcpy(buffer, OW_SPIFFS_ROOT, root);
    buffer[root] = '/';
    memcpy(buffer + root + 1, path + skip, path_len - skip);
    buffer[root + 1 + path_len - skip] = 0;
    return true;
}

int urt_spiffs_exists(const char *path, size_t path_len)
{
    char buffer[128];
    if (!ow_spiffs_ready() || !ow_spiffs_path(path, path_len, buffer, sizeof(buffer)))
        return 0;
    struct stat st;
    return stat(buffer, &st) == 0 && S_ISREG(st.st_mode);
}

int urt_spiffs_open(const char *path, size_t path_len, bool write, bool truncate)
{
    char buffer[128];
    if (!ow_spiffs_ready() || !ow_spiffs_path(path, path_len, buffer, sizeof(buffer)))
        return -1;
    int flags = write ? (O_RDWR | O_CREAT) : O_RDONLY;
    if (write && truncate)
        flags |= O_TRUNC;
    int fd = open(buffer, flags, 0644);
    if (fd < 0)
        ow_spiffs_last_errno = errno;
    return fd;
}

ptrdiff_t urt_spiffs_read(int fd, void *buffer, size_t length)
{
    ptrdiff_t n = read(fd, buffer, length);
    if (n < 0)
        ow_spiffs_last_errno = errno;
    return n;
}


int urt_spiffs_info(uint64_t *total, uint64_t *used)
{
    if (!ow_spiffs_ready())
        return -1;
    size_t t = 0, u = 0;
    esp_err_t err = esp_spiffs_info(NULL, &t, &u);
    *total = t;
    *used = u;
    return err == ESP_OK ? 0 : -1;
}

int urt_spiffs_last_error(void)
{
    return ow_spiffs_last_errno;
}

// SPIFFS has no directories; its VFS reports the flat namespace as a single
// listing at the mount root. Exposed raw -- urt.file synthesises the
// hierarchy from '/' in the names.
#define OW_SPIFFS_MAX_SCANS 2

static DIR *ow_spiffs_scans[OW_SPIFFS_MAX_SCANS];

int urt_spiffs_scan_open(void)
{
    if (!ow_spiffs_ready())
        return -1;

    int h = -1;
    for (int i = 0; i < OW_SPIFFS_MAX_SCANS; ++i)
    {
        if (!ow_spiffs_scans[i])
        {
            h = i;
            break;
        }
    }
    if (h < 0)
        return -1;

    DIR *d = opendir(OW_SPIFFS_ROOT);
    if (!d)
    {
        ow_spiffs_last_errno = errno;
        return -1;
    }
    ow_spiffs_scans[h] = d;
    return h;
}

ptrdiff_t urt_spiffs_scan_read(int h, char *name, size_t name_len, uint64_t *size)
{
    if (h < 0 || h >= OW_SPIFFS_MAX_SCANS || !ow_spiffs_scans[h])
        return -1;

    errno = 0;
    struct dirent *e = readdir(ow_spiffs_scans[h]);
    if (!e)
    {
        if (errno)
        {
            ow_spiffs_last_errno = errno;
            return -1;
        }
        return 0;
    }

    size_t len = strlen(e->d_name);
    if (len > name_len)
        len = name_len;
    memcpy(name, e->d_name, len);

    *size = 0;
    char full[128];
    const size_t root = sizeof(OW_SPIFFS_ROOT) - 1;
    if (root + 1 + len + 1 <= sizeof(full))
    {
        memcpy(full, OW_SPIFFS_ROOT, root);
        full[root] = '/';
        memcpy(full + root + 1, e->d_name, len);
        full[root + 1 + len] = '\0';
        struct stat st;
        if (stat(full, &st) == 0)
            *size = (uint64_t)st.st_size;
    }
    return (ptrdiff_t)len;
}

void urt_spiffs_scan_close(int h)
{
    if (h < 0 || h >= OW_SPIFFS_MAX_SCANS || !ow_spiffs_scans[h])
        return;
    closedir(ow_spiffs_scans[h]);
    ow_spiffs_scans[h] = NULL;
}

ptrdiff_t urt_spiffs_write(int fd, const void *data, size_t length)
{
    ptrdiff_t n = write(fd, data, length);
    if (n < 0)
        ow_spiffs_last_errno = errno;
    return n;
}

void urt_spiffs_close(int fd)
{
    close(fd);
}

uint64_t urt_spiffs_size(int fd)
{
    struct stat st;
    if (fstat(fd, &st) == 0)
        return (uint64_t)st.st_size;
    ow_spiffs_last_errno = errno;
    return 0;
}

int64_t urt_spiffs_seek(int fd, int64_t offset, int whence)
{
    return lseek(fd, (off_t)offset, whence);
}

int urt_spiffs_truncate(int fd, uint64_t length)
{
    return ftruncate(fd, (off_t)length);
}

int urt_spiffs_sync(int fd)
{
    return fsync(fd);
}

