open-watt/urt/src/urt/driver/esp32/ow_shim.c
int urt_spiffs_unlink(const char *path, size_t path_len)
{
    char buffer[128];
    if (!ow_spiffs_ready() || !ow_spiffs_path(path, path_len, buffer, sizeof(buffer)))
        return -1;
    return unlink(buffer);
}

int urt_spiffs_rename(const char *from, size_t from_len, const char *to, size_t to_len)
{
    char from_buffer[128], to_buffer[128];
    if (!ow_spiffs_ready() ||
        !ow_spiffs_path(from, from_len, from_buffer, sizeof(from_buffer)) ||
        !ow_spiffs_path(to, to_len, to_buffer, sizeof(to_buffer)))
        return -1;
    return rename(from_buffer, to_buffer);
}

int urt_spiffs_stat(const char *path, size_t path_len, uint64_t *size)
{
    char buffer[128];
    if (!ow_spiffs_ready() || !ow_spiffs_path(path, path_len, buffer, sizeof(buffer)))
        return -1;
    struct stat st;
    if (stat(buffer, &st) != 0)
        return -1;
    *size = (uint64_t)st.st_size;
    return 0;
}

// Formatting a multi-megabyte partition blocks for long enough to starve the
// watchdog, so it runs on its own task and the caller polls for completion.
enum { OW_SPIFFS_FORMAT_IDLE = 0, OW_SPIFFS_FORMAT_RUNNING, OW_SPIFFS_FORMAT_COMPLETE, OW_SPIFFS_FORMAT_FAILED };

static volatile int ow_spiffs_format_state = OW_SPIFFS_FORMAT_IDLE;

static void ow_spiffs_format_task(void *argument)
{
    (void)argument;
    esp_err_t err = esp_spiffs_format(NULL);
    if (err == ESP_OK)
    {
        // Formatting leaves the partition mounted but unregistered; drop that so
        // the next access can register a VFS on it.
        if (!ow_spiffs_registered && esp_spiffs_mounted(NULL))
            esp_vfs_spiffs_unregister(NULL);
        ow_spiffs_mount_state = 0;
    }
    ow_spiffs_format_state = (err == ESP_OK) ? OW_SPIFFS_FORMAT_COMPLETE : OW_SPIFFS_FORMAT_FAILED;
    vTaskDelete(NULL);
}

int urt_spiffs_format_begin(void)
{
    if (ow_spiffs_format_state == OW_SPIFFS_FORMAT_RUNNING)
        return 0;
    ow_spiffs_format_state = OW_SPIFFS_FORMAT_RUNNING;
    if (xTaskCreate(ow_spiffs_format_task, "ow-spiffs-fmt", 4096, NULL, tskIDLE_PRIORITY + 1, NULL) != pdPASS)
    {
        ow_spiffs_format_state = OW_SPIFFS_FORMAT_FAILED;
        return -1;
    }
    return 0;
}

int urt_spiffs_available(void)
{
    return ow_spiffs_ready() ? 1 : 0;
}

int urt_spiffs_format_status(void)
{
    return ow_spiffs_format_state;
}

#endif // OW_USE_SPIFFS
